INSERT INTO roles (role_name) VALUES
('Admin'), ('Manager'), ('Customer'), ('Jeweler'), ('Accountant');

INSERT INTO users (role_id, user_name, user_password_hash, user_phone, user_email) VALUES
(1, 'Алиса Смирнова', 'hash123', '1234567890', 'alisa@company.com'),
(2, 'Борис Иванов', 'hash456', '2345678901', 'boris@company.com'),
(3, 'Виктор Петров', 'hash789', '3456789012', 'viktor@company.com'),
(4, 'Дмитрий Соколов', 'hash321', '4567890123', 'dmitriy@company.com'),
(3, 'Елена Кузнецова', 'hash654', '5678901234', 'elena@company.com'),
(1, 'Фёдор Михайлов', 'hash987', '6789012345', 'fedor@company.com'),
(2, 'Григорий Павлов', 'hash159', '7890123456', 'grigoriy@company.com'),
(5, 'Глеб Васильев', 'hash753', '8901234567', 'gleb@company.com'),
(5, 'Ирина Романова', 'hash951', '9012345678', 'irina@company.com'),
(3, 'Яков Морозов', 'hash357', '0123456789', 'yakov@company.com');

INSERT INTO statuses (status_name) VALUES
('Создан'), ('Удалён'), ('Выполнен'), ('Аннулирован'), ('Подтверждён'), ('Оплачен'), ('В процессе');

INSERT INTO product_types (product_type_name) VALUES
('Кольцо'), ('Ожерелье'), ('Браслет'), ('Серьги'),
('Брошь'), ('Цепь');

INSERT INTO orders (product_type_id, customer_user_id, manager_user_id, jeweler_user_id, status_id, order_comment, order_price, order_date, order_update_date) VALUES
(1, 3, 2, 4, 1, 'Срочный заказ', 250.00, '2025-03-01 10:00:00', '2025-03-02 12:00:00'),
(2, 3, 2, 4, 2, 'Индивидуальный дизайн', 400.50, '2025-03-02 11:30:00', '2025-03-03 14:00:00'),
(3, 3, 2, 4, 3, 'Требуется подарочная упаковка', 150.75, '2025-03-03 09:45:00', '2025-03-04 16:30:00'),
(4, 3, 2, 4, 4, 'Экспресс-доставка', 600.00, '2025-03-04 13:20:00', '2025-03-05 18:00:00'),
(5, 3, 2, 4, 5, 'Позолоченное изделие', 350.90, '2025-03-05 15:00:00', '2025-03-06 20:15:00'),
(6, 3, 2, 4, 6, 'Ручная работа', 275.30, '2025-03-06 10:40:00', '2025-03-07 12:50:00'),
(1, 3, 2, 4, 7, 'Вариант из серебра', 180.00, '2025-03-07 08:30:00', '2025-03-08 10:20:00'),
(2, 3, 2, 4, 1, 'Запрошена гравировка', 500.00, '2025-03-08 14:15:00', '2025-03-09 17:30:00'),
(3, 3, 2, 4, 2, 'Ограниченная серия', 720.45, '2025-03-09 16:45:00', '2025-03-10 19:00:00'),
(4, 3, 2, 4, 3, 'Дополнительные камни', 810.75, '2025-03-10 18:00:00', '2025-03-11 20:45:00');

INSERT INTO units (unit_short_name, unit_full_name) VALUES
('g', 'Грамм'), 
('oz', 'Унция'), 
('ct', 'Карат');

INSERT INTO materials (unit_id, material_price, material_name, material_quantity) VALUES
(3, 50.00, 'Золото', 100.0),      
(2, 30.00, 'Серебро', 200.0),      
(3, 100.00, 'Платина', 50.0),     
(1, 10.00, 'Медь', 500.0),        
(3, 500.00, 'Бриллиант', 20.0),   
(1, 5.00, 'Бронза', 300.0),       
(3, 450.00, 'Рубин', 25.0),      
(3, 400.00, 'Сапфир', 30.0),     
(3, 420.00, 'Изумруд', 22.0),    
(3, 80.00, 'Опал', 35.0);         

INSERT INTO order_details (order_id, material_id, order_material_weight) VALUES
(1, 1, 5.0),  
(2, 2, 3.5),  
(3, 3, 2.2),   
(4, 4, 50.0),  
(5, 5, 1.1),  
(6, 6, 40.0), 
(1, 7, 1.8), 
(2, 8, 2.0),   
(3, 9, 1.6), 
(4, 10, 3.0);